app/controllers/wei_users_controller.rb

SELECT "wei_users".* FROM "wei_users"
---
  def index
    @wei_users = WeiUser.all

DELETE FROM "wei_users"
---
  def delette
    #@wei_user = WeiUser.delete_all
    WeiUser.delete_all

INSERT INTO "wei_users" ("address", "created_at", "description", "latitude", "longitude", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @wei_user = WeiUser.new(wei_user_params)

    respond_to do |format|
      if @wei_user.save

UPDATE "wei_users" SET "latitude" = ?, "longitude" = ?, "updated_at" = ? WHERE "wei_users"."id" = 3  [["latitude", 51.1078852], ["longitude", 17.0385376], ["updated_at", Wed, 19 Mar 2014 06:07:18 UTC +00:00]]
---
  def update
    respond_to do |format|
      if @wei_user.update(wei_user_params)

DELETE FROM "wei_users" WHERE "wei_users"."id" = ?  [["id", 2]]
---
  def destroy
    @wei_user.destroy

SELECT "wei_users".* FROM "wei_users" WHERE "wei_users"."id" = ? LIMIT 1  [["id", "3"]]
---
    def set_wei_user
      @wei_user = WeiUser.find(params[:id])